---
kind: enumMember
id: F:Autodesk.Revit.DB.ExternalService.ExternalServiceResult.Unhandled
enum: Autodesk.Revit.DB.ExternalService.ExternalServiceResult
source: html/63c83d88-92c7-5283-8b39-efb0baeedcd8.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServiceResult.Unhandled

Execution of a service has not been handled; possibly because there are no applicable servers.